[
  {
    "number": 1,
    "title": "Supplication Before Sleeping",
    "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوْتُ وَأَحْيَا",
    "latin": "bismika, allahumma amuutu wa ahyaa",
    "translation": "In Your name, O Allah, I die and I live.",
    "notes": null,
    "benefits": "The Prophet, peace and blessings be upon him, always started and ended his day with dhikr.",
    "source": "HR. al-Bukhari",
    "category": "Sleep"
  },
  {
    "number": 2,
    "title": "Supplication Upon Waking Up",
    "arabic": "الحَمْدُ للهِ الَّذِي أَحْيَانَا بعْدَ مَا أماتَنَا وإِلَيْهِ النُّشُورُ",
    "latin": "alhamdulillahilladzi ahyaanaa ba'da maa amaatanaa wa ilaihin nusyuur",
    "translation": "All praise is for Allah who gives us life after He has caused us to die, and to Him is the resurrection.",
    "notes": null,
    "benefits": "By reciting the supplication above, a servant begins his day by praising the name of Allah, the Giver of Life and the Bringer of Death.",
    "source": "HR. Bukhari: 6327",
    "category": "Morning"
  },
  {
    "number": 3,
    "title": "Supplication Entering the Bathroom",
    "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
    "latin": "allahumma innii a'uudzubika minal khubutsi wal khabaaitsi",
    "translation": "O Allah, I seek refuge in You from the evil and the wicked.",
    "notes": null,
    "benefits": "This supplication acts as a barrier between a servant's private parts and the jinn when entering the bathroom.",
    "source": "HR. al-Bukhari and Muslim",
    "category": "Bathroom"
  },
  {
    "number": 4,
    "title": "Supplication Leaving the Bathroom",
    "arabic": "غُفْرَانَكَ",
    "latin": "ghuf-raanak",
    "translation": "I ask for Your forgiveness (O Allah).",
    "notes": null,
    "benefits": "The bathroom is one of the homes of the jinn and devils, so it is recommended to ask for forgiveness for any mistakes, intentional or unintentional, made while in the bathroom.",
    "source": "HR. at-Tirmidzi",
    "category": "Bathroom"
  },
  {
    "number": 5,
    "title": "Supplication Before Eating",
    "arabic": "بِسْمِ اللَّهِ",
    "latin": "bismillah",
    "translation": "In the name of Allah.",
    "notes": null,
    "benefits": "The benefit of reciting Bismillah before eating is to prevent Satan from joining humans in eating.",
    "source": "HR. al-Bukari No. 5376 and Muslim No. 2022",
    "category": "Eating"
  },
  {
    "number": 6,
    "title": "Supplication If Forgetting Bismillah at the Beginning of a Meal",
    "arabic": "بِسْمِ اللَّهِ أَوَّلَهُ وَآخِرَهُ",
    "latin": "bismillahi awwaluhu wa aakhiruhu",
    "translation": "In the name of Allah, at its beginning and its end.",
    "notes": null,
    "benefits": "Islam pays great attention to etiquette. If someone forgets to recite the supplication before eating at the beginning, it is still recommended to recite it in the middle, even if there is only a spoonful of rice left.",
    "source": "HR. Abu Dawud",
    "category": "Eating"
  },
  {
    "number": 7,
    "title": "Supplication After Eating",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِى أَطْعَمَنِى هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّى وَلاَ قُوَّةٍ",
    "latin": "alhamdulillaahilladzii ath'amanii haadzaa wa rozaqoniihi min ghoiri haulin minnii wa laa quwwatin",
    "translation": "All praise is to Allah who has fed me this and provided for me without any power or strength from me.",
    "notes": null,
    "benefits": "The Messenger of Allah, peace and blessings be upon him, said that if someone recites this supplication, then his past sins will be forgiven.",
    "source": "Shahih at-Tirmidzi",
    "category": "Eating"
  },
  {
    "number": 8,
    "title": "Supplication Entering the Mosque",
    "arabic": "اَللَّهُمَّ افْتَحْ لِيْ أَبْوَابَ رَحْمَتِكَ",
    "latin": "allahummaftah lii abwaaba rahmatika",
    "translation": "O Allah, open the doors of Your mercy for me.",
    "notes": null,
    "benefits": "The mosque is the house of Allah; a servant should honor it and hope for Allah's mercy within it.",
    "source": "HR. Muslim",
    "category": "Mosque"
  },
  {
    "number": 9,
    "title": "Supplication Leaving the Mosque",
    "arabic": "اَللَّهُمَّ إِنِّيْ أَسْأَلُكَ مِنْ فَضْلِكَ",
    "latin": "allahumma innii as'aluka min fadhlika",
    "translation": "O Allah, I ask You for Your bounty.",
    "notes": null,
    "benefits": "Allah's earth is vast, and there are many ways to seek provision. A servant should ask for Allah's bounty to be facilitated in obtaining the provision that Allah has distributed to all His servants.",
    "source": "HR. Muslim No. 713",
    "category": "Mosque"
  },
  {
    "number": 10,
    "title": "Supplication Before Performing Ablution",
    "arabic": "بِسْمِ اللَّهِ",
    "latin": "bismillah",
    "translation": "In the name of Allah.",
    "notes": null,
    "benefits": "It is prescribed to begin every important matter by saying Bismillah, whether it be an act of worship or otherwise.",
    "source": "HR. at-Tirmidzi and al-Baihaqi",
    "category": "Ablution"
  },
  {
    "number": 11,
    "title": "Supplication After Performing Ablution",
    "arabic": "أشْهَدُ أنْ لا إله إِلاَّ اللَّهُ وَحْدَهُ لا شَرِيك لَهُ ، وأشْهَدُ أنَّ مُحَمَّداً عَبْدُهُ وَرَسُولُهُ ، اللَّهُمَّ اجْعَلْنِي مِنَ التَوَّابِينَ ، واجْعَلْني مِنَ المُتَطَهِّرِينَ ، سُبْحانَكَ اللَّهُمَّ وبِحَمْدِكَ ، أشْهَدُ أنْ لا إلهَ إِلاَّ أنْتَ ، أسْتَغْفِرُكَ وأتُوبُ إِلَيْكَ",
    "latin": "asyhadu an laa ilaaha illa allah wadahu laa syariika lahu, wa asyhadu anna muhammadan 'abduhu wa rasuuluhu. allahummaj 'alni minat tawwaabiina waj 'alnii minal mutathaahiriina. subhaanaka allahumma wa bihamdika asyhadu an laa ilaaha illa anta astaghfiruka wa atuubu ilaika",
    "translation": "I bear witness that there is no deity except Allah alone, with no partner, and I bear witness that Muhammad is His servant and Messenger. O Allah, make me among those who repent and make me among those who purify themselves. Glory be to You, O Allah, and with Your praise, I bear witness that there is no deity except You. I seek Your forgiveness and repent to You.",
    "notes": null,
    "benefits": "Whoever recites this supplication, eight gates of Paradise will be opened for him, and he may enter from whichever gate he wishes.",
    "source": "HR. Muslim, at-Tirmidzi and an-Nasa'i",
    "category": "Ablution"
  },
  {
    "number": 12,
    "title": "Supplication for Breaking the Fast",
    "arabic": "ذَهَبَ الظَّمَأُ وابْتَلَّتِ الْعُرُوقُ وثَبَتَ اْلأَجْرُ إِنْ شَاءَاللهُ",
    "latin": "dzahabazh zhoma'u wabtallatil 'uruqu wa tsabatal ajru insya Allah",
    "translation": "The thirst has gone, the veins are moistened, and the reward is confirmed, if Allah wills.",
    "notes": null,
    "benefits": "It is highly recommended for those who are fasting to increase their supplications before and after breaking the fast, because the supplication of a fasting person is one of the three supplications that are not rejected.",
    "source": "HR. Abu Daud, As-Sunan Al-Kubra Lil Baihaqi, Vol. 4, p. 239, al-Hakim in Mustadrak 'alas Shahihain No. 1484",
    "category": "Fasting"
  },
  {
    "number": 13,
    "title": "Supplication Entering the House #1",
    "arabic": "اَلسَّلَامُ عَلَيْكُمْ",
    "latin": "assalaamu 'alaykum",
    "translation": "Peace be upon you.",
    "notes": null,
    "benefits": "The greeting is a supplication of hope, a hope that you will be safe from all kinds of sorrow and suffering, and be enveloped in mercy and blessings.",
    "source": "HR. at-Tirmidzi",
    "category": "Home"
  },
  {
    "number": 14,
    "title": "Supplication Entering the House #2",
    "arabic": "اَلسَّلَامُ عَلَيْكُمْ وَرَحْمَةُ اللهِ وَبَرَكَا تُهُ",
    "latin": "assalaamu 'alaykum warahmatullaahi wabarakaatuh",
    "translation": "Peace, mercy, and blessings of Allah be upon you.",
    "notes": null,
    "benefits": "The greeting is a supplication of hope, a hope that you will be safe from all kinds of sorrow and suffering, and be enveloped in mercy and blessings.",
    "source": "HR. at-Tirmidzi",
    "category": "Home"
  },
  {
    "number": 15,
    "title": "Supplication Leaving the House",
    "arabic": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ، لَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
    "latin": "bismillaah, tawakkaltu 'alallaah, laa haula wa laa quwwata illaa billaah",
    "translation": "In the name of Allah, I place my trust in Allah. There is no might nor power except with Allah.",
    "notes": null,
    "benefits": "Whoever recites this supplication, it will be said to him: \"You will be guided, sufficed, and protected.\" Satan will then depart from him. Another satan will say: \"How can you harm someone who has been guided, sufficed, and protected?!\"",
    "source": "HR. Abu Dawud and at-Tirmidzi",
    "category": "Home"
  },
  {
    "number": 16,
    "title": "Supplication for Protection from Causing or Experiencing Harm Outside the House",
    "arabic": "اللَّهُمَّ إِنِّى أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ أَوْ أَزِلَّ أَوْ أُزَلَّ أَوْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَىَّ",
    "latin": "allaahumma innii a'uudzu bika an adhilla au udholla, au azilla au azulla, au azhlima au uzhlama, au ajhala au yujhala 'alayya",
    "translation": "O Allah, I seek refuge in You lest I should stray or be led astray, slip or be tripped, wrong or be wronged, or act foolishly or have foolishness done to me.",
    "notes": null,
    "benefits": "When a person leaves the house, they will encounter all kinds of things, both good and bad, especially harm caused by themselves. Therefore, it is commanded to seek refuge from oneself and from others.",
    "source": "HR. Abu Dawud, at-Tirmidzi, Ibn Majah and an-Nasa'i",
    "category": "Home"
  },
  {
    "number": 17,
    "title": "Travel Supplication",
    "arabic": "اللَّهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا وَاطْوِ عَنَّا بُعْدَهُ اللَّهُمَّ أَنْتَ الصَّاحِبُ فِى السَّفَرِ وَالْخَلِيفَةُ فِى الأَهْلِ اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِى الْمَالِ وَالأَهْلِ",
    "latin": " allahumma inna nas aluka fii safarina hadzaa al-birra wat taqwa wa minal amali maa tardhaa. allahumma hawwin 'alaina safarana haadza wathwi 'anna bu'dahu. allahumma anta shaahibu fi safar. wal khaliifatu fil ahli. allahumma inni a'uudzubika min wa'tsaa-issafari wa ka-aabatil mandzari wa suuil munqalabi fil maali wal ahli",
    "translation": " O Allah, we ask You for righteousness and piety in this journey of ours, and for deeds that please You. O Allah, lighten for us the hardship of this journey and quickly bring us to our destination. O Allah, You are our Companion on the journey and the Guardian of our families. O Allah, I seek refuge in You from the hardship of travel, from a bad return, and from seeing something unpleasant concerning our wealth, family, or children.",
    "notes": null,
    "benefits": "This supplication has two parts. The first is praise of Allah and the submission of the servant. The second is a request to Allah for ease in travel and in the affairs of what the servant has left at home.",
    "source": "HR. Muslim",
    "category": "Travel"
  },
  {
    "number": 18,
    "title": "Supplication of a Resident for Someone Who is Traveling",
    "arabic": "أَسْتَوْدِعُ اللَّهَ دِينَكَ وَأَمَانَتَكَ وَخَوَاتِيمَ عَمَلِكَ",
    "latin": "astawdi'ullaha diinaka, wa amaanataka, wa khawaatiima a'maalik",
    "translation": "I entrust your religion, your trust, and the end of your deeds to Allah.",
    "notes": null,
    "benefits": "Three priorities of a servant that must be maintained everywhere: religion, trust, and deeds, because a person will be resurrected according to their deeds.",
    "source": "HR. Abu Dawud: 2601",
    "category": "Travel"
  },
  {
    "number": 19,
    "title": "Supplication for Piety from a Resident to Someone Who is Traveling",
    "arabic": "زَوَّدَكَ اللَّهُ التَّقْوَى وَغَفَرَ ذَنْبَكَ  وَيَسَّرَ لَكَ الْخَيْرَ حَيْثُمَا كُنْتَ",
    "latin": "zawwadakallahut taqwa, wa ghafara dzanbaka, wa yassara lakal khaira haitsumaa kunta",
    "translation": "May Allah provide you with piety, forgive your sins, and ease goodness for you wherever you are.",
    "notes": null,
    "benefits": "Piety is the best provision that a servant must prepare for the Hereafter, because there is no salvation except through piety.",
    "source": "HR. at-Tirmidzi",
    "category": "Travel"
  },
  {
    "number": 20,
    "title": "Supplication When Wearing New Clothes",
    "arabic": "اللَّهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ",
    "latin": "allahumma lakal hamdu anta kasawtaniihi. as-aluka min khoirihi wa khoiri maa shuni'a lah, wa a'udzu bika min syarrihi wa syarri maa shuni'a lah",
    "translation": "O Allah, to You is all praise. You have clothed me with this. I ask You for its goodness and the goodness for which it was made, and I seek refuge in You from its evil and the evil for which it was made.",
    "notes": null,
    "benefits": "By reciting this supplication, one asks that the clothes they have bought may provide goodness and also be a protection against various evils.",
    "source": "HR. Ahmad, Abu Dawud, at-Tirmidzi and Al-Hakim",
    "category": "Clothing"
  },
  {
    "number": 21,
    "title": "Supplication When Wearing Clothes",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِى كَسَانِى هَذَا الثَّوْبَ وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّى وَلاَ قُوَّةٍ",
    "latin": "alhamdu lillaahil ladzii kasaanii haadzaa wa rozaqoniihi min ghoiri hawlim minni wa laa quwwatin",
    "translation": "Praise be to Allah who has clothed me with this garment and provided it for me without any power or strength from me.",
    "notes": null,
    "benefits": "The virtue of reciting this supplication is that past sins will be forgiven, God willing.",
    "source": "HR. all compilers of Sunan books, except Nasa'i",
    "category": "Clothing"
  },
  {
    "number": 22,
    "title": "Supplication When Mounting a Vehicle",
    "arabic": "بِسْمِ اللَّهِ، بِسْمِ اللَّهِ، بِسْمِ اللَّهِ، الحَمْدُ للِه، سُبْحَانَ الَّذِى سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ، سُبْحَانَكَ إِنِّى قَدْ ظَلَمْتُ نَفْسِى فَاغْفِرْ لِى فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ",
    "latin": "bismillah, bismillah, bismillah, alhamdulillah, subhaanalladzi sakh-khara lanaa haadzaa wa maa kunnaa lahuu muqriniin. wa innaa ilaa rabbinaa lamun qalibuun. subhaanaka inni qad dzalamtu nafsii, faghfirlii fa-innahuu laa yaghfirudz dzunuuba illaa anta",
    "translation": "In the name of Allah, in the name of Allah, in the name of Allah. All praise is to Allah. Glory be to Him who has subjected this to us, and we could not have done so by ourselves. And indeed, to our Lord we will return. Glory be to You, indeed I have wronged myself, so forgive me, for none can forgive sins except You.",
    "notes": null,
    "benefits": "By reciting the supplication for mounting a vehicle, our journey will always be under the protection of Allah. In addition, we will also receive rewards, help, and a calmer heart.",
    "source": "HR. Abu Dawud and at-Tirmidzi",
    "category": "Travel"
  },
  {
    "number": 23,
    "title": "Supplication When it Rains",
    "arabic": "اللَّهُمَّ صَيِّبًا نَافِعًا",
    "latin": "allahumma shayyiban naafi'aa",
    "translation": "O Allah, make it a beneficial rain.",
    "notes": null,
    "benefits": "It is encouraged to pray when it rains so that goodness and blessings increase, as well as its benefits.",
    "source": "HR. al-Bukhari No. 1032",
    "category": "Weather"
  },
  {
    "number": 24,
    "title": "Supplication During Heavy Rain",
    "arabic": "اللَّهُمَّ حَوَالَيْنَا وَلاَ عَلَيْنَا ، اللَّهُمَّ عَلَى الآكَامِ وَالظِّرَابِ وَبُطُونِ الأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ",
    "latin": "allahumma haawalaina wa laa 'alaina. allahumma 'alal aakami wal jibaali, wazh zhiroobi, wa buthunil awdiyati, wa manaabitisy syajari",
    "translation": "O Allah, (let the rain fall) around us, not on us. O Allah, (let it fall) on the hills, mountains, small mountains, valleys, and places where trees grow.",
    "notes": null,
    "benefits": "The supplication above is recited when the rain gets heavier or there is a concern that the rain will cause harm.",
    "source": "HR. al-Bukhari No. 1014",
    "category": "Weather"
  },
  {
    "number": 25,
    "title": "Supplication After it Rains",
    "arabic": "مُطِرْنا بفَضْلِ اللهِ ورَحْمَتِهِ",
    "latin": "muthirna bi fadhlillahi wa rohmatih",
    "translation": "We have been given rain by the bounty and mercy of Allah.",
    "notes": null,
    "benefits": "By reciting this supplication, one believes that rain falls by the will of Allah (Allah's virtue), not by the stars, so they do not become disbelievers in Allah.",
    "source": "HR. al-Bukhari No. 846 and Muslim No. 71",
    "category": "Weather"
  },
  {
    "number": 26,
    "title": "Supplication During Strong Wind",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا، وَأَعُوْذُ بِكَ مِنْ شَرِّهَا",
    "latin": "allaahumma innii as-aluka khoirohaa wa a'uudzubika min syarrihaa",
    "translation": "O Allah, I ask You for the good of this wind, and I seek refuge in You from its evil.",
    "notes": null,
    "benefits": "Among the signs of Allah's power is a strong wind that can bring blessings and punishment, namely good and bad. Therefore, a servant should continue to ask for good and seek refuge from all harm.",
    "source": "HR. Abu Dawud and Ibnu Majah",
    "category": "Weather"
  },
  {
    "number": 27,
    "title": "The Best Supplication for Seeking Forgiveness (Sayyid al-Istighfar)",
    "arabic": "اَللَّهُمَّ أَنْتَ رَبِّيْ ، لَا إِلٰـهَ إِلاَّ أَنْتَ خَلَقْتَنِيْ وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ ، أَعُوْذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ ، أَبُوْءُ لَكَ بِنِعْمتِكَ عَلَيَّ ، وَأَبُوْءُ بِذَنْبِيْ فَاغْفِرْ لِيْ ، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ",
    "latin": "allahumma anta rabbii laa ilaaha illaa anta khalaqtanii wa anna 'abduka wa anaa 'alaa 'ahdika wa wa'dika mastatha'tu a'uudzu bika min syarri maa shana'tu abuu u laka bini' matika 'alayya wa abuu-u bidzanbii faghfir lii fa innahu laa yaghfirudz dzunuuba illa anta",
    "translation": "O Allah, You are my Lord. There is no deity worthy of worship except You. You created me, and I am Your servant. I abide to Your covenant and promise as best I can. I seek refuge in You from the evil of what I have done. I acknowledge Your blessings upon me, and I acknowledge my sin. So forgive me, for none can forgive sins except You.",
    "notes": null,
    "benefits": "Whoever recites it with certainty in the evening, and then he dies, he will enter Paradise, and likewise if (recited) in the morning.",
    "source": "HR. al-Bukhari No. 6306, 6323, Ahmad IV/122-125, an-Nasa'i VIII/279-280",
    "category": "General"
  },
  {
    "number": 28,
    "title": "Supplication for Ease in All Matters",
    "arabic": "اللَّهُمَّ لاَ سَهْلَ إِلاَّ مَا جَعَلْتَهُ سَهْلاً وَأَنْتَ تَجْعَلُ الحَزْنَ إِذَا شِئْتَ سَهْلاً",
    "latin": "allahumma laa sahla illa maa ja'altahu sahlaa, wa anta taj'alul hazna idza syi'ta sahlaa",
    "translation": "O Allah, there is no ease except in that which You make easy, and You make the difficult easy if You wish.",
    "notes": null,
    "benefits": "Ease comes only from Allah. Even something difficult can become easy if Allah wills it.",
    "source": "HR. Ibn Hibban",
    "category": "General"
  },
  {
    "number": 29,
    "title": "Supplication When Afflicted by Calamity",
    "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ أْجُرْنِى فِى مُصِيبَتِى وَأَخْلِفْ لِى خَيْرًا مِنْهَا",
    "latin": "inna lillahi wa inna ilaihi rooj'un. allahumma'jurnii fii mushibatii wa akhlif lii khoiron minhaa",
    "translation": "Indeed we belong to Allah, and indeed to Him we will return. O Allah, reward me for my affliction and replace it with something better.",
    "notes": null,
    "benefits": "A servant should recite the supplication above when afflicted by calamity with certainty and hope. God willing, with this, they will receive a better replacement.",
    "source": "HR. Muslim",
    "category": "Difficulty"
  },
  {
    "number": 30,
    "title": "Supplication When in Debt",
    "arabic": "اللَّهُمَّ اكْفِنِى بِحَلاَلِكَ عَنْ حَرَامِكَ وَأَغْنِنِى بِفَضْلِكَ عَمَّنْ سِوَاكَ",
    "latin": "allahumak-finii bi halaalika 'an haroomik, wa agh-niniy bi fadhlika 'amman siwaak",
    "translation": "O Allah, suffice me with what is lawful and keep me away from what is unlawful, and enrich me with Your bounty so I do not depend on anyone besides You.",
    "notes": null,
    "benefits": "Lawful provision, even if it is little, is better than abundant unlawful wealth.",
    "source": "HR. at-Tirmidzi No. 2563",
    "category": "Financial"
  },
  {
    "number": 31,
    "title": "Supplication for Protection from Laziness, Sadness, and Debt",
    "arabic": "اَللّٰهُمَّ إِنِّى أَعُوْذُبِكَ مِنَ الْهَمِّ وَالْحَزْنِ وَأَعُوْذُبِكَ مِنَ الْعَجْزِ وَالْكَسَلِ وَأَعُوْذُبِكَ مِنَ الْجُبْنِ وَالْبُخْلِ وَأَعُوْذُبِكَ مِنْ غَلَبَتِ الدَّيْنِ وَقَهْرِ الرجال",
    "latin": "allahumma innii a'uudzu bika minal hammi wal hazan. wa a'udzu bika minal 'ajzi wal kasal. wa a'udzu bika minal jubni wal bukhl. wa a'uudzu bika min ghalabatid daini wa qahrir rijaal",
    "translation": "O Allah, I seek refuge in You from anxiety and grief, and I seek refuge in You from incapacity and laziness, and I seek refuge in You from cowardice and miserliness, and I seek refuge in You from being overpowered by debt and from being overcome by men.",
    "notes": null,
    "benefits": "Abu Umamah then narrated: After I practiced this supplication, Allah truly removed my anxiety and gave me the ability to repay my debt.",
    "source": "HR. Abu Dawud No. 1555",
    "category": "Difficulty"
  },
  {
    "number": 32,
    "title": "Supplication After Sneezing",
    "arabic": "الحَمْدُ للهِ",
    "latin": "alhamdulillah",
    "translation": "All praise is to Allah.",
    "notes": null,
    "benefits": "Indeed, Allah loves sneezing because it moves a person to worship. It is encouraged to respond to the praise of Allah by someone who praises Allah, and vice versa.",
    "source": "HR. al-Bukhari",
    "category": "Social Etiquette"
  },
  {
    "number": 33,
    "title": "Supplication Upon Hearing Someone Sneeze",
    "arabic": "يَرْحَمُكَ اللهُ",
    "latin": "yarhamukallah",
    "translation": "May Allah have mercy on you.",
    "notes": null,
    "benefits": "Indeed, Allah loves sneezing because it moves a person to worship. It is encouraged to respond to the praise of Allah by someone who praises Allah, and vice versa.",
    "source": "HR. al-Bukhari",
    "category": "Social Etiquette"
  },
  {
    "number": 34,
    "title": "Response to Someone Who Says 'Yarhamukallah' After You Sneeze",
    "arabic": "يَهْدِيكُمُ اللهُ وَيُصْلِحُ بَالَكُمْ",
    "latin": "yahdikumullah wa yushlihu baalakum",
    "translation": "May Allah guide you and improve your condition.",
    "notes": null,
    "benefits": "Indeed, Allah loves sneezing because it moves a person to worship. It is encouraged to respond to the praise of Allah by someone who praises Allah, and vice versa.",
    "source": "HR. al-Bukhari",
    "category": "Social Etiquette"
  },
  {
    "number": 35,
    "title": "Supplication for Good Character",
    "arabic": "اللَّهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",
    "latin": "allahumma kamaa hassanta kholqii fahassin khuluqii",
    "translation": "O Allah, just as You have made my external form good, make my character good as well.",
    "notes": null,
    "benefits": "A charming appearance is not enough provision for a Muslim, but it must be accompanied by noble character. Therefore, a Muslim should constantly ask for their character to be improved and beautified.",
    "source": "HR. Ahmad, authenticated by al-Albani in al-Irwa', 1/115",
    "category": "General"
  },
  {
    "number": 36,
    "title": "Prayer for Protection from Satan",
    "arabic": "رَبِّ أَعُوْذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِيْنِ وَأَعُوْذُ بِكَ رَبِّ أَنْ يَحْضُرُوْنِ",
    "latin": "rabbi a'uudzu bika min hamazaatisy-syayaathiin wa a'uudzu bika rabbi ay yahdhuruun",
    "translation": "My Lord, I seek refuge in You from the whispers of Satan, and I seek refuge in You, my Lord, from their presence around me.",
    "notes": null,
    "benefits": "Indeed, Allah commands the Prophet Muhammad and all his followers to seek refuge from the whispers of Satan in all activities, especially when approaching death. Satan whispers evil into the hearts of humans, encouraging wrongdoing.",
    "source": "QS. Al-Mu'minun: 97-98",
    "category": "Protection"
  },
  {
    "number": 37,
    "title": "Prayer After the Adhan",
    "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ الْقَائِمَةِ، آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ",
    "latin": "allahumma rabba haadzihid da'watit taammah, wasshalaatil qaaaimah, aati muhammadanil wasiilata wal fadhiiilata, wab'atshu maqaaman mahmuuda alladzii wa'adtah",
    "translation": "O Allah, Lord of this perfect call and the established prayer, grant Muhammad the wasilah (a high status in Paradise) and the excellence (above all creation), and raise him to the praiseworthy station that You have promised him.",
    "notes": null,
    "benefits": "This prayer is recommended by the Prophet Muhammad (peace be upon him) for those who hear the call to prayer. It has many benefits, including receiving intercession from the Prophet on the Day of Judgment, attaining the wasilah and honor in Paradise for the Prophet, and receiving great and commendable reward from Allah. It is also a way to show respect and admiration for Allah and His Messenger, expressing love and longing for the Prophet Muhammad, the role model for Muslims.",
    "source": "Narrated by Abu Dawud (529), at-Tirmidhi (211), an-Nasa'i (2:26), Ibn Majah (722)",
    "category": "Prayer"
  },
  {
    "number": 38,
    "title": "Prayer for Forgiveness for Parents",
    "arabic": "رَبَّنَا ٱغْفِرْ لِى وَلِوَٰلِدَىَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ ٱلْحِسَابُ",
    "latin": "rabbanagfir lii wa liwaalidayya wa lil-mu'miniina yauma yaquumul-hiisaab",
    "translation": "Our Lord, forgive me and my parents and all the believers on the Day the account is established.",
    "notes": null,
    "benefits": "This is a prayer of Prophet Ibrahim (peace be upon him), teaching us to honor and love our parents, remember the Day of Judgment, and care for fellow believers. By making this prayer, we hope that Allah will forgive our sins and make us among the faithful.",
    "source": "QS. Ibrahim: 41",
    "category": "General"
  },
  {
    "number": 39,
    "title": "Supplication When Visiting the Sick",
    "arabic": "لَا بَأْسَ طَهُورٌ إِنْ شَاءَ اللَّهُ",
    "latin": "laa ba'sa thahuurun in syaa allah",
    "translation": "Do not worry, it will be a purification (for you), if Allah wills.",
    "notes": null,
    "benefits": "Visiting the sick is a highly recommended act in Islam. This supplication provides comfort and hope to the sick person, reminding them that illness can be a means of purification from sins.",
    "source": "HR. al-Bukhari No. 3616",
    "category": "Health"
  },
  {
    "number": 40,
    "title": "Supplication for the Sick Person to Recite",
    "arabic": "اللَّهُمَّ اشْفِنِي وَعَافِنِي وَارْحَمْنِي",
    "latin": "allahummashfinii wa 'aafinii warhamnii",
    "translation": "O Allah, heal me, grant me wellness, and have mercy on me.",
    "notes": null,
    "benefits": "This supplication combines three essential requests: healing from illness, overall wellness and protection, and Allah's mercy. It is a comprehensive prayer for those suffering from any ailment.",
    "source": "HR. Ibn Majah",
    "category": "Health"
  },
  {
    "number": 41,
    "title": "Supplication When Experiencing Fear or Loneliness",
    "arabic": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
    "latin": "laa ilaaha illaa anta subhaanaka innii kuntu minazh zhaalimiin",
    "translation": "There is no deity except You; glory be to You. Indeed, I have been of the wrongdoers.",
    "notes": null,
    "benefits": "This is the supplication of Prophet Yunus (Jonah) when he was in the belly of the whale. The Prophet Muhammad said that no Muslim says this supplication for anything except that Allah will answer him.",
    "source": "HR. at-Tirmidzi No. 3505",
    "category": "Difficulty"
  },
  {
    "number": 42,
    "title": "Supplication Before Studying or Learning",
    "arabic": "رَبِّ زِدْنِي عِلْمًا وَارْزُقْنِي فَهْمًا",
    "latin": "rabbi zidnii 'ilman warzuqnii fahmaa",
    "translation": "My Lord, increase me in knowledge and grant me understanding.",
    "notes": null,
    "benefits": "Seeking knowledge is a form of worship in Islam. This supplication asks Allah to increase one's knowledge and grant the understanding to properly comprehend and apply what is learned.",
    "source": "Based on QS. Taha: 114",
    "category": "Knowledge"
  },
  {
    "number": 43,
    "title": "Supplication After Completing a Study Session",
    "arabic": "اللَّهُمَّ انْفَعْنِي بِمَا عَلَّمْتَنِي وَعَلِّمْنِي مَا يَنْفَعُنِي",
    "latin": "allahummanfa'nii bimaa 'allamtanii wa 'allimnii maa yanfa'unii",
    "translation": "O Allah, benefit me with what You have taught me, and teach me what will benefit me.",
    "notes": null,
    "benefits": "Knowledge should be beneficial and applied. This supplication asks Allah to help us benefit from what we've learned and to continue teaching us useful knowledge.",
    "source": "HR. at-Tirmidzi and Ibn Majah",
    "category": "Knowledge"
  },
  {
    "number": 44,
    "title": "Supplication Before an Exam or Test",
    "arabic": "اللَّهُمَّ لَا سَهْلَ إِلَّا مَا جَعَلْتَهُ سَهْلًا وَأَنْتَ تَجْعَلُ الْحَزْنَ إِذَا شِئْتَ سَهْلًا",
    "latin": "allahumma laa sahla illaa maa ja'altahu sahlaa wa anta taj'alul hazna idzaa syi'ta sahlaa",
    "translation": "O Allah, nothing is easy except what You make easy, and You make the difficult easy if You wish.",
    "notes": null,
    "benefits": "This supplication helps calm nerves before exams and reminds us that success comes from Allah. It instills confidence that with Allah's help, even difficult questions can become manageable.",
    "source": "HR. Ibn Hibban",
    "category": "Knowledge"
  },
  {
    "number": 45,
    "title": "Supplication When Looking in the Mirror",
    "arabic": "اللَّهُمَّ أَنْتَ حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي",
    "latin": "allahumma anta hassanta kholqii fahassin khuluqii",
    "translation": "O Allah, as You have made my external appearance beautiful, make my character beautiful too.",
    "notes": null,
    "benefits": "This supplication reminds us that inner beauty (character) is more important than outer beauty. It helps us remember to focus on improving our manners and behavior.",
    "source": "HR. Ahmad and Ibn Hibban",
    "category": "General"
  },
  {
    "number": 46,
    "title": "Supplication When Experiencing Anger",
    "arabic": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "latin": "a'uudzu billaahi minasy syaythaanir rajiim",
    "translation": "I seek refuge in Allah from the accursed Satan.",
    "notes": null,
    "benefits": "The Prophet Muhammad taught that anger comes from Satan. By seeking refuge in Allah, we can control our anger and avoid saying or doing things we will regret.",
    "source": "HR. al-Bukhari No. 3282 and Muslim No. 2610",
    "category": "Protection"
  },
  {
    "number": 47,
    "title": "Supplication When Seeing Someone Afflicted with Hardship",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي مِمَّا ابْتَلَاكَ بِهِ وَفَضَّلَنِي عَلَى كَثِيرٍ مِمَّنْ خَلَقَ تَفْضِيلًا",
    "latin": "alhamdulillaahil ladzii 'aafaanii mimmabtalaka bihi wa fadhdhalonii 'alaa katsiirin mimman kholaqa tafdliilaa",
    "translation": "All praise is to Allah who has granted me well-being from that which He has tested you with, and favored me over much of His creation.",
    "notes": "This supplication should be said quietly, not in front of the afflicted person, to avoid causing them distress.",
    "benefits": "This supplication teaches gratitude for Allah's blessings and protection. It reminds us that our good health and circumstances are gifts from Allah.",
    "source": "HR. at-Tirmidzi No. 3432",
    "category": "General"
  },
  {
    "number": 48,
    "title": "Supplication for Seeking Good in This World and the Hereafter",
    "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
    "latin": "rabbanaa aatinaa fid dunyaa hasanatan wa fil aakhirati hasanatan wa qinaa 'adzaaban naar",
    "translation": "Our Lord, give us good in this world and good in the Hereafter, and protect us from the punishment of the Fire.",
    "notes": null,
    "benefits": "This was the most frequently used supplication by the Prophet Muhammad. It encompasses all worldly and spiritual needs, asking for goodness in both lives and protection from Hell.",
    "source": "HR. al-Bukhari No. 4522 and Muslim No. 2688",
    "category": "General"
  },
  {
    "number": 49,
    "title": "Supplication When Hearing Thunder",
    "arabic": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ",
    "latin": "subhaanalladzi yusabbihur ro'du bihamdihi wal malaa-ikatu min khiifatih",
    "translation": "Glory be to Him whom the thunder glorifies with His praise, and the angels out of fear of Him.",
    "notes": null,
    "benefits": "Thunder is a natural phenomenon that glorifies Allah. By reciting this supplication, we remember Allah's power and join in His glorification.",
    "source": "HR. Malik in al-Muwatta and al-Bukhari in al-Adab al-Mufrad",
    "category": "Weather"
  },
  {
    "number": 50,
    "title": "Supplication for Protection from the Evil Eye",
    "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ",
    "latin": "a'uudzu bikalimaatillaahit taammati min kulli syaythaanin wa haammatin wa min kulli 'ainin laammah",
    "translation": "I seek refuge in the perfect words of Allah from every devil, every poisonous creature, and from every evil eye.",
    "notes": null,
    "benefits": "The evil eye is real and can affect people. This supplication provides protection from the evil eye and other harmful entities.",
    "source": "HR. al-Bukhari No. 3371",
    "category": "Protection"
  },
  {
    "number": 51,
    "title": "Supplication When Hearing a Dog Bark at Night",
    "arabic": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
    "latin": "a'uudzu billaahi minasy syaythaanir rajiim",
    "translation": "I seek refuge in Allah from the accursed Satan.",
    "notes": null,
    "benefits": "The Prophet Muhammad said that when dogs bark at night, they see what humans cannot see. Seeking refuge in Allah provides protection from what may be causing the disturbance.",
    "source": "HR. Abu Dawud",
    "category": "Protection"
  },
  {
    "number": 52,
    "title": "Supplication When Seeing the New Moon",
    "arabic": "اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْيُمْنِ وَالْإِيمَانِ وَالسَّلَامَةِ وَالْإِسْلَامِ رَبِّي وَرَبُّكَ اللَّهُ",
    "latin": "allahumma ahillahu 'alainaa bil yumni wal iimaan wassalaamati wal islaam rabbii wa rabbukallah",
    "translation": "O Allah, bring it over us with blessing, faith, safety, and Islam. My Lord and your Lord is Allah.",
    "notes": null,
    "benefits": "The new moon marks the beginning of a new Islamic month. This supplication asks Allah to make the coming month blessed and filled with faith and safety.",
    "source": "HR. at-Tirmidzi No. 3451 and ad-Darimi",
    "category": "General"
  },
  {
    "number": 53,
    "title": "Supplication When Giving Charity",
    "arabic": "اللَّهُمَّ اجْعَلْهَا مَغْنَمًا وَلَا تَجْعَلْهَا مَغْرَمًا",
    "latin": "allahummaj 'alhaa maghnaman wa laa taj'alhaa maghromaa",
    "translation": "O Allah, make it a means of reward and do not make it a burden.",
    "notes": null,
    "benefits": "This supplication purifies the intention when giving charity, ensuring it is done sincerely for Allah's sake and will be rewarded, not becoming a source of pride or regret.",
    "source": "HR. Ibn Majah",
    "category": "Financial"
  },
  {
    "number": 54,
    "title": "Supplication When Receiving Charity",
    "arabic": "بَارَكَ اللَّهُ لَكَ فِي أَهْلِكَ وَمَالِكَ",
    "latin": "baarakallahu laka fii ahlika wa maalik",
    "translation": "May Allah bless you in your family and wealth.",
    "notes": null,
    "benefits": "Expressing gratitude to the giver and praying for their blessings is the proper etiquette when receiving charity. It encourages continued generosity.",
    "source": "HR. an-Nasa'i",
    "category": "Social Etiquette"
  },
  {
    "number": 55,
    "title": "Supplication for Ease in Childbirth",
    "arabic": "لَا إِلَهَ إِلَّا اللَّهُ الْحَلِيمُ الْكَرِيمُ سُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ الْعَظِيمِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
    "latin": "laa ilaaha illallaahul haliimul kariim subhaanallaahi rabbil 'arsyil 'azhiim alhamdulillaahi rabbil 'aalamiin",
    "translation": "There is no deity except Allah, the Forbearing, the Generous. Glory be to Allah, Lord of the Mighty Throne. All praise is to Allah, Lord of the worlds.",
    "notes": null,
    "benefits": "Childbirth is a difficult time for women. This supplication asks for Allah's mercy and ease during labor and delivery.",
    "source": "HR. al-Bukhari No. 6345 and Muslim No. 2730",
    "category": "Health"
  },
  {
    "number": 56,
    "title": "Supplication for a Newborn Child",
    "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لَامَّةٍ",
    "latin": "u'iidzuka bikalimaatillaahit taammati min kulli syaythaanin wa haammatin wa min kulli 'ainin laammah",
    "translation": "I seek protection for you in the perfect words of Allah from every devil, every poisonous creature, and from every evil eye.",
    "notes": null,
    "benefits": "The Prophet used to seek protection for his grandchildren al-Hasan and al-Husayn with this supplication. It protects the child from harm and evil.",
    "source": "HR. al-Bukhari No. 3371",
    "category": "Family"
  },
  {
    "number": 57,
    "title": "Supplication When Congratulating on a Newborn",
    "arabic": "بَارَكَ اللَّهُ لَكَ فِي الْمَوْهُوبِ لَكَ وَشَكَرْتَ الْوَاهِبَ وَبَلَغَ أَشُدَّهُ وَرُزِقْتَ بِرَّهُ",
    "latin": "baarakallahu laka fil mauhubi laka wa syakartol waahiba wa balagha asyyuddahu wa ruziqta birroh",
    "translation": "May Allah bless you with His gift to you, may you give thanks to the Giver, may the child reach maturity, and may you be granted his righteousness.",
    "notes": null,
    "benefits": "This is a beautiful and comprehensive supplication when congratulating someone on the birth of a child, asking for blessings and righteousness.",
    "source": "Traditional Islamic supplication",
    "category": "Family"
  },
  {
    "number": 58,
    "title": "Supplication Upon Hearing Good News",
    "arabic": "الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ",
    "latin": "alhamdulillaahil ladzii bini'matihi tatimmus shoolihaat",
    "translation": "All praise is to Allah by whose favor good deeds are accomplished.",
    "notes": null,
    "benefits": "Expressing gratitude to Allah when receiving good news acknowledges that all blessings come from Him and increases one's faith.",
    "source": "HR. Ibn Majah and al-Hakim",
    "category": "General"
  },
  {
    "number": 59,
    "title": "Supplication Upon Hearing Bad News",
    "arabic": "الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ",
    "latin": "alhamdulillaahi 'alaa kulli haal",
    "translation": "All praise is to Allah in every circumstance.",
    "notes": null,
    "benefits": "Even in difficult times, praising Allah helps maintain patience and reminds us that He is in control of all affairs.",
    "source": "HR. Ibn Majah and al-Hakim",
    "category": "Difficulty"
  },
  {
    "number": 60,
    "title": "Supplication When Attending a Wedding",
    "arabic": "بَارَكَ اللَّهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
    "latin": "baarakallahu laka wa baaraka 'alaika wa jama'a bainakumaa fii khoir",
    "translation": "May Allah bless you, bestow blessings upon you, and unite you both in goodness.",
    "notes": null,
    "benefits": "This supplication asks Allah to bless the marriage and bring the couple together in goodness, harmony, and righteousness.",
    "source": "HR. Abu Dawud No. 2130 and at-Tirmidzi",
    "category": "Family"
  },
  {
    "number": 61,
    "title": "Supplication for Seeking Guidance in a Decision (Istikhara)",
    "arabic": "اللَّهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ الْعَظِيمِ",
    "latin": "allahumma innii astakhiiruka bi'ilmika wa astaqdiruka biqudrotika wa as-aluka min fadhlika al'azhiim",
    "translation": "O Allah, I seek Your guidance through Your knowledge, I seek ability through Your power, and I ask You from Your great bounty.",
    "notes": "This is the beginning portion of the longer Istikhara prayer. It should be recited after performing two units of prayer when making an important decision.",
    "benefits": "The Istikhara prayer helps Muslims seek Allah's guidance in important decisions, trusting that He knows what is best and has power over all things.",
    "source": "HR. al-Bukhari No. 1162",
    "category": "General"
  },
  {
    "number": 62,
    "title": "Supplication When Experiencing a Nightmare",
    "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ غَضَبِهِ وَعِقَابِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِ",
    "latin": "a'uudzu bikalimaatillaahit taammaati min ghodobihi wa 'iqoobi wa syarri 'ibaadihi wa min hamazaatisy syayaathiin wa ay yahdhuruun",
    "translation": "I seek refuge in the perfect words of Allah from His anger, His punishment, the evil of His servants, the whispers of devils, and their presence around me.",
    "notes": "After reciting this, one should spit lightly to the left three times and change sleeping position.",
    "benefits": "The Prophet taught that nightmares come from Satan. This supplication provides protection and helps one return to peaceful sleep.",
    "source": "HR. Abu Dawud and at-Tirmidzi",
    "category": "Sleep"
  },
  {
    "number": 63,
    "title": "Supplication for Settling a Dispute",
    "arabic": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الْعَرْشِ الْعَظِيمِ كُنْ لِي جَارًا مِنْ شَرِّ عِبَادِكَ كُلِّهِمْ جَمِيعًا أَنْ يَفْرُطَ عَلَيَّ أَحَدٌ مِنْهُمْ أَوْ يَطْغَى",
    "latin": "allahumma rabbas samaawaatis sab'i wa rabbal 'arsyil 'azhiim kun lii jaaran min syarri 'ibadika kullihim jamii'an ay yafruta 'alayya ahadun minhum au yathghaa",
    "translation": "O Allah, Lord of the seven heavens and Lord of the Mighty Throne, be my protector from the evil of all Your servants, lest any of them should transgress against me or oppress me.",
    "notes": null,
    "benefits": "When facing conflict or potential harm from others, this supplication asks Allah for His protection and support in resolving the matter justly.",
    "source": "HR. al-Bukhari in al-Adab al-Mufrad",
    "category": "Protection"
  },
  {
    "number": 64,
    "title": "Supplication for Forgiveness of the Deceased",
    "arabic": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ وَعَافِهِ وَاعْفُ عَنْهُ",
    "latin": "allahummaghfir lahu warhamhu wa 'aafihi wa'fu 'anhu",
    "translation": "O Allah, forgive him, have mercy on him, grant him wellness, and pardon him.",
    "notes": null,
    "benefits": "This supplication is part of the funeral prayer. It asks Allah to forgive the deceased, show them mercy, and grant them a good standing in the Hereafter.",
    "source": "HR. Muslim No. 963",
    "category": "Death"
  },
  {
    "number": 65,
    "title": "Supplication for Patience When Someone Dies",
    "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَاخْلُفْ لِي خَيْرًا مِنْهَا",
    "latin": "innaa lillaahi wa innaa ilaihi raaji'uun allahumma'jurnii fii mushiibatii wakhluf lii khoiron minhaa",
    "translation": "Indeed we belong to Allah, and indeed to Him we will return. O Allah, reward me in my affliction and replace it with something better.",
    "notes": null,
    "benefits": "Death is one of the most difficult tests. This supplication helps maintain patience and trust in Allah, knowing that He will compensate the loss with something better.",
    "source": "HR. Muslim No. 918",
    "category": "Death"
  },
  {
    "number": 66,
    "title": "Supplication When Visiting a Graveyard",
    "arabic": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ نَسْأَلُ اللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ",
    "latin": "assalaamu 'alaikum ahlad diyaari minal mu'miniina wal muslimiina wa innaa in syaa-allaahu bikum laahiquun nas-alullaha lanaa walakumul 'aafiyah",
    "translation": "Peace be upon you, O inhabitants of this place, from among the believers and Muslims. Indeed, we will, if Allah wills, join you. We ask Allah for well-being for us and for you.",
    "notes": null,
    "benefits": "Visiting graveyards reminds us of death and the Hereafter. This supplication shows respect to the deceased and reminds us of our own mortality.",
    "source": "HR. Muslim No. 974",
    "category": "Death"
  },
  {
    "number": 67,
    "title": "Supplication for Increased Provision",
    "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا وَرِزْقًا طَيِّبًا وَعَمَلًا مُتَقَبَّلًا",
    "latin": "allahumma innii as-aluka 'ilman naafi'an wa rizqon thoyyiban wa 'amalan mutaqobbalaa",
    "translation": "O Allah, I ask You for beneficial knowledge, lawful provision, and accepted deeds.",
    "notes": null,
    "benefits": "This comprehensive supplication asks for three essential elements of a good life: beneficial knowledge to guide us, lawful provision to sustain us, and accepted deeds that will benefit us in the Hereafter.",
    "source": "HR. Ibn Majah No. 925",
    "category": "Financial"
  },
  {
    "number": 68,
    "title": "Supplication for Righteous Offspring",
    "arabic": "رَبِّ هَبْ لِي مِنْ لَدُنْكَ ذُرِّيَّةً طَيِّبَةً إِنَّكَ سَمِيعُ الدُّعَاءِ",
    "latin": "rabbi hab lii min ladunka dzurriyyatan thoyyibatan innaka samii'ud du'aa",
    "translation": "My Lord, grant me from You a good offspring. Indeed, You are the Hearer of supplication.",
    "notes": null,
    "benefits": "This is the supplication of Prophet Zakariya asking for righteous children. It is recommended for those who wish for children or want their existing children to be righteous.",
    "source": "QS. Ali 'Imran: 38",
    "category": "Family"
  }
]
